app/controllers/authors_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 4]]